data_analysis/repo/gpu_log/benchmark_20250628_034329_mDeepSeek-R1-Distill-Llama-70B_np200_mc70_in512_out2048.log
INFO 06-28 03:43:34 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=70, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=512', 'output_len=2048', 'serving=dynamo_sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=2048, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 70
100%|██████████| 200/200 [00:52<00:00,  3.77it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  53.00     
Total input tokens:                      102200    
Total generated tokens:                  149009    
Request throughput (req/s):              3.77      
Output token throughput (tok/s):         2811.64   
Total Token throughput (tok/s):          4740.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          171.17    
Median TTFT (ms):                        66.32     
P99 TTFT (ms):                           383.60    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.95     
Median TPOT (ms):                        17.10     
P99 TPOT (ms):                           18.77     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.81     
Median ITL (ms):                         14.87     
P99 ITL (ms):                            45.02     
==================================================